import 'package:community_marketplace/features/presentation/models/terms_model.dart';

final List<TermModel> termData = [
  TermModel(
    title: 'การลงทะเบียน',
    content:
        'ผู้ใช้ต้องกรอกข้อมูลจริงและถูกต้อง เพื่อความปลอดภัยในการใช้งาน ข้อมูลส่วนบุคคลจะถูกเก็บรักษาอย่างปลอดภัยตามมาตรฐานสากล และจะไม่ถูกนำไปใช้ในทางที่ผิด',
  ),
  TermModel(
    title: 'การลงทะเบียน',
    content:
        'ผู้ใช้ต้องกรอกข้อมูลจริงและถูกต้อง เพื่อความปลอดภัยในการใช้งาน ข้อมูลส่วนบุคคลจะถูกเก็บรักษาอย่างปลอดภัยตามมาตรฐานสากล และจะไม่ถูกนำไปใช้ในทางที่ผิด',
  ),
  TermModel(
    title: 'การลงทะเบียน',
    content:
        'ผู้ใช้ต้องกรอกข้อมูลจริงและถูกต้อง เพื่อความปลอดภัยในการใช้งาน ข้อมูลส่วนบุคคลจะถูกเก็บรักษาอย่างปลอดภัยตามมาตรฐานสากล และจะไม่ถูกนำไปใช้ในทางที่ผิด',
  ),
  TermModel(
    title: 'การลงทะเบียน',
    content:
        'ผู้ใช้ต้องกรอกข้อมูลจริงและถูกต้อง เพื่อความปลอดภัยในการใช้งาน ข้อมูลส่วนบุคคลจะถูกเก็บรักษาอย่างปลอดภัยตามมาตรฐานสากล และจะไม่ถูกนำไปใช้ในทางที่ผิด',
  ),
  TermModel(
    title: 'ความเป็นส่วนตัว',
    content:
        'ข้อมูลส่วนบุคคลของผู้ใช้จะไม่ถูกเปิดเผยให้กับบุคคลที่สาม โดยไม่ได้รับความยินยอมจากผู้ใช้ เว้นแต่กรณีที่กฎหมายกำหนด หาก Android app เก็บรวบรวมข้อมูลการใช้งานเพื่อปรับปรุงบริการ',
  ),
  TermModel(
    title: 'การซื้อขาย',
    content:
        'ผู้ใช้รับผิดชอบต่อการทำรายการซื้อขายของตนเอง แอปพลิเคชันทำหน้าที่เป็นตัวกลางเท่านั้น การชำระเงินและการส่งสินค้าเป็นความรับผิดชอบของผู้ซื้อและผู้ขายโดยตรง',
  ),
  TermModel(
    title: 'ข้อจำกัดความรับผิดชอบ',
    content:
        'แอปพลิเคชันไม่รับผิดชอบต่อความเสียหายที่เกิดขึ้นจากการใช้งาน หรือปัญหาที่เกิดขึ้นจากการทำรายการระหว่างผู้ใช้ ผู้ใช้ควรตรวจสอบความน่าเชื่อถือของคู่ค้าก่อนทำรายการ',
  ),
  TermModel(
    title: 'การปรับปรุงเงื่อนไข',
    content:
        'บริษัทขอสงวนสิทธิ์ในการปรับปรุงแก้ไขข้อตกลงและเงื่อนไขการใช้งานได้ตลอดเวลา โดยจะแจ้งให้ผู้ใช้ทราบล่วงหน้าผ่านทางแอปพลิเคชัน การใช้งานต่อไปถือว่ายอมรับเงื่อนไขใหม่',
  ),
];
